#coding=UTF-8

#Задание 3.3

#Запрос данных от пользователя

print("Введите ваше имя и город.")
name = input()
city = input()
print("Имя {0}. Город {1}.".format(name,city))